#1.       %占位符
name='张三'
age=20
print('我叫%s,今年%d岁' % (name,age))

#2          {}
print('我叫{0},今年{1}岁'.format(name,age))

#3          f-string
print(f'我叫{name},今年{age}岁')


print('-----------------------------------')

print('%10d' % 99)      #10表示宽度
print('%.3f' % 3.1415926)       #.3表示小数点后三位
#同时表示宽度和精度
print('%10.3f' % 3.141526)       #总宽度为10，小数点后3位

print('----------------------------------')
print('{0:.3}'.format(3.1415926))           #.3表示一共三位数
print('{:.3f}'.format(3.1415926))          #.3f表示3位小数
print('{:10.3f}'.format(3.1415926))         #同时设置宽度和精度，一共 10位，3位小数